; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph3 - mode
	spectrograph1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star1 - direction
	Star2 - direction
	GroundStation7 - direction
	Star3 - direction
	Star11 - direction
	Star4 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	GroundStation6 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Planet17)
	(have_image Star12 thermograph3)
	(have_image Star13 spectrograph1)
	(have_image Star14 thermograph0)
	(have_image Phenomenon15 infrared2)
	(have_image Planet16 infrared2)
	(have_image Planet17 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation10 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation10)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 star13 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 star13)
   goals met: 0 of 8
5. (take_image satellite1 star13 instrument3 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite1 star12 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star12)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 8
8. (take_image satellite1 star12 instrument3 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 2 of 8
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
10. (calibrate satellite0 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon15 instrument1 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 3 of 8
13. (turn_to satellite0 planet16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet16)
   goals met: 3 of 8
14. (take_image satellite0 planet16 instrument1 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 4 of 8
15. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 4 of 8
16. (take_image satellite0 planet17 instrument1 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 5 of 8
17. (turn_to satellite0 star14 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star14)
   goals met: 5 of 8
18. (take_image satellite0 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 6 of 8
19. (turn_to satellite0 star3 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star3)
   goals met: 7 of 8
20. (turn_to satellite1 planet17 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet17)
   goals met: 8 of 8
